porkcube/firmware/variants/nrf52840/diy/dmm-01/variant.h
#ifndef _SEEED_XIAO_NRF52840_PLUS_H_
#define _SEEED_XIAO_NRF52840_PLUS_H_

/** Master clock frequency */
#define VARIANT_MCK       (64000000ul)

#define USE_LFXO      // Board uses 32khz crystal for LF
//#define USE_LFRC    // Board uses RC for LF

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

#define PINS_COUNT              (39)
#define NUM_DIGITAL_PINS        (39)
#define NUM_ANALOG_INPUTS       (8)
#define NUM_ANALOG_OUTPUTS      (0)

// LEDs
#define PIN_LED                 (LED_RED)
#define LED_PWR                 (PINS_COUNT)
#define PIN_NEOPIXEL            (PINS_COUNT)
#define NEOPIXEL_NUM            (0)

#define LED_BUILTIN             (PIN_LED)

#define LED_RED                 (11)
#define LED_GREEN               (13)
#define LED_BLUE                (12)

#define LED_STATE_ON            1    // (1)     // State when LED is litted

// Buttons
// #define PIN_BUTTON1             (PINS_COUNT)

// Digital PINs
static const uint8_t D0  = 0 ;
static const uint8_t D1  = 1 ;
static const uint8_t D2  = 2 ;
static const uint8_t D3  = 3 ;
static const uint8_t D4  = 4 ;
static const uint8_t D5  = 5 ;
static const uint8_t D6  = 6 ;
static const uint8_t D7  = 7 ;
static const uint8_t D8  = 8 ;
static const uint8_t D9  = 9 ;
static const uint8_t D10 = 10;

static const uint8_t D11 = 30;
static const uint8_t D12 = 31;
static const uint8_t D13 = 32;
static const uint8_t D14 = 33;
static const uint8_t D15 = 34;
static const uint8_t D16 = 35;
static const uint8_t D17 = 36;
static const uint8_t D18 = 37;
static const uint8_t D19 = 38;

#define VBAT_ENABLE             (14)    // Output LOW to enable reading of the BAT voltage.
                                        // https://wiki.seeedstudio.com/XIAO_BLE#q3-what-are-the-considerations-when-using-xiao-nrf52840-sense-for-battery-charging

#define PIN_CHARGING_CURRENT    (22)    // Battery Charging current
                                        // https://wiki.seeedstudio.com/XIAO_BLE#battery-charging-current

// Analog pins
#define PIN_A0                  (0)     // (-1)
#define PIN_A1                  (1)
#define PIN_A2                  (2)
#define PIN_A3                  (3)
#define PIN_A4                  (4)     // (-1)
#define PIN_A5                  (5)
#define PIN_VBAT                (35)    // Read the BAT voltage.
                                        // https://wiki.seeedstudio.com/XIAO_BLE#q3-what-are-the-considerations-when-using-xiao-nrf52840-sense-for-battery-charging

static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t ADC_BAT  = PIN_VBAT;

#define ADC_RESOLUTION          (12)

// #define PIN_BUTTON1 D3  // D3 // (3)  // 29 // P0.29
/// v1_1 has single button, v1.0 had 2
// BUTTON_A
#define PIN_BUTTON1 (3)  // D3 // (3)  // 29 // P0.29
#ifdef V1_0
// BUTTON_B
#define PIN_BUTTON2 (33) //  D14  // (9)  // 4 // P0.09
#endif      // V1_0

// trackball
#define HAS_TRACKBALL 1
#define TB_UP D2     // 28    // DPADC
#define TB_DOWN D1   // 3   // DPADA
#define TB_LEFT D12  // 19  // DPADB
#define TB_RIGHT D13 // 33 // DPADD
// #ifdef V1_1
// #define TB_PRESS D14
// #endif
#define TB_DIRECTION FALLING
// #define TB_DIRECTION RISING
// #define TB_THRESHOLD 3

// Other pins
// #define PIN_NFC1                (33)
// #define PIN_NFC2                (34)

#ifdef USE_GPS
#define GPS_L76K
#define HAS_GPS 1
#define GPS_BAUDRATE 9600
// #define GPS_THREAD_INTERVAL 50
#endif    // USE_GPS

// Serial interfaces
#define PIN_SERIAL1_TX D4
#define PIN_SERIAL1_RX D15

static const uint8_t RX  = PIN_SERIAL1_RX;
static const uint8_t TX  = PIN_SERIAL1_TX;

#define PIN_SERIAL2_RX        (-1)
#define PIN_SERIAL2_TX        (-1)

static const uint8_t RX1  = PIN_SERIAL2_RX;
static const uint8_t TX1  = PIN_SERIAL2_TX;

// SPI Interfaces
#define SPI_INTERFACES_COUNT    (1) // (2)

// SPI ~ LR1121
// #define USE_LR1121
#ifdef USE_LR1121
#define PIN_SPI_MOSI  D10 // (32 + 15)
#define PIN_SPI_MISO  D9  // (32 + 14)
#define PIN_SPI_SCK   D8  // (32 + 13)
#define PIN_SPI_NSS   D7  // (32 + 12)

// static const uint8_t MOSI = PIN_SPI_MOSI;
// static const uint8_t MISO = PIN_SPI_MISO;
// static const uint8_t SCK = PIN_SPI_SCK;
// static const uint8_t SS = PIN_SPI_NSS;

// #ifdef USE_LR1121
#define LR1121_IRQ_PIN           D0 // D19        // (0 + 10)      // P0.10 IRQ
#define LR1121_NRESET_PIN        D17        // LORA_RESET // P0.09 NRST
#define LR1121_BUSY_PIN          D18        // (0 + 29)     // P0.29 BUSY
#define LR1121_SPI_NSS_PIN       D7         // LORA_CS   // P1.13
#define LR1121_SPI_SCK_PIN       D8         // LORA_SCK
#define LR1121_SPI_MISO_PIN      D9         // LORA_MISO
#define LR1121_SPI_MOSI_PIN      D10        // LORA_MOSI
#define LR11X0_DIO3_TCXO_VOLTAGE 1.8
#define LR11X0_DIO_AS_RF_SWITCH
#endif





// // SPI LR1121
// // ----------
// #define SPI_LR1121
// #ifdef SPI_LR1121
// // #define SPI_INTERFACES_COUNT 1

// #define PIN_SPI_MOSI  D10 // (32 + 15)
// #define PIN_SPI_MISO  D9  // (32 + 14)
// #define PIN_SPI_SCK   D8  // (32 + 13)
// #define PIN_SPI_NSS   D7  // (32 + 12)

// static const uint8_t MOSI = PIN_SPI_MOSI;
// static const uint8_t MISO = PIN_SPI_MISO;
// static const uint8_t SCK = PIN_SPI_SCK;
// static const uint8_t SS = PIN_SPI_NSS;

// #define LORA_RESET D17       // (32 + 3)  // P1.03 ~ RST
// #define LORA_DIO1  D19       // (32 + 7)  // P1.07 ~ IRQ/DIO1
// #define LORA_DIO2  D18       // (32 + 5)   // P1.05 ~ BUSY/DIO2
// #define LORA_SCK   D8        // (32 + 13)   // P1.13 ~ SCK
// #define LORA_MISO  D9        // (32 + 14)  // P1.14 ~ MISO
// #define LORA_MOSI  D10       // (32 + 15)  // P1.15 ~ MOSI
// #define LORA_CS    D7        // (32 + 12)    // P1.12 ~ CS

// // supported modules list
// #define USE_LR1110

// #define LR1110_IRQ_PIN LORA_DIO1
// #define LR1110_BUSY_PIN LORA_DIO2
// #define LR1110_NRESET_PIN LORA_RESET
// #define LR1110_SPI_NSS_PIN LORA_CS
// #define LR1110_SPI_SCK_PIN LORA_SCK
// #define LR1110_SPI_MOSI_PIN LORA_MOSI
// #define LR1110_SPI_MISO_PIN LORA_MISO

// #define LR11X0_DIO3_TCXO_VOLTAGE 1.6
// #define LR11X0_DIO_AS_RF_SWITCH
// #endif


// #define PIN_SPI_MISO            (9)
// #define PIN_SPI_MOSI            (10)
// #define PIN_SPI_SCK             (8)

// static const uint8_t SS   = 7;
// static const uint8_t MOSI = PIN_SPI_MOSI;
// static const uint8_t MISO = PIN_SPI_MISO;
// static const uint8_t SCK  = PIN_SPI_SCK ;

// #define PIN_SPI1_MISO           (37)
// #define PIN_SPI1_MOSI           (36)
// #define PIN_SPI1_SCK            (38)

// static const uint8_t MOSI1 = PIN_SPI1_MOSI;
// static const uint8_t MISO1 = PIN_SPI1_MISO;
// static const uint8_t SCK1  = PIN_SPI1_SCK ;

// Wire Interfaces
#define WIRE_INTERFACES_COUNT   (1) // (2)

#define PIN_WIRE_SDA            (5) // (11)  // (5)  // (4) // (4)
#define PIN_WIRE_SCL            (6) // (0) // (6)  // (5) // (15) // (5)

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;

// #define PIN_WIRE1_SDA           (17)
// #define PIN_WIRE1_SCL           (16)
// #define PIN_LSM6DS3TR_C_POWER   (15)
// #define PIN_LSM6DS3TR_C_INT1    (18)

// // i2s Interfaces
// #define PIN_I2S_SCK             (31)
// #define PIN_I2S_SD              (30)
// #define PIN_I2S_WS              (32)

// static const uint8_t I2S_SCK = PIN_I2S_SCK;
// static const uint8_t I2S_SD  = PIN_I2S_SD ;
// static const uint8_t I2S_WS  = PIN_I2S_WS ;

// PDM Interfaces
// #define PIN_PDM_PWR	            (19)
// #define PIN_PDM_CLK	            (20)
// #define PIN_PDM_DIN	            (21)

// QSPI Pins
// #define PIN_QSPI_SCK            (24)
// #define PIN_QSPI_CS             (25)
// #define PIN_QSPI_IO0            (26)
// #define PIN_QSPI_IO1            (27)
// #define PIN_QSPI_IO2            (28)
// #define PIN_QSPI_IO3            (29)

// On-board QSPI Flash
// #define EXTERNAL_FLASH_DEVICES  (P25Q16H)
// #define EXTERNAL_FLASH_USE_QSPI

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#endif
